/******************************************************************************
 * @内容	LierdaAPI头文件
 * @设计	Lierda NB-IoT 软件设计团队@2018
******************************************************************************/
#ifndef S_LIERDA_APP_MAIN_H_
#define S_LIERDA_APP_MAIN_H_



#include "neulfw.h"
#include "app_at_log.h"


#define lierdaLogview  APP_AT_NORMAL

/******************************************************************************
 * @函数名:lierdaLog
 * @参数:同库函数"printf"用法，自动增加回车换行
 * @返回值:执行成功返回0，不成功返回-1
 * @重要修改记录:qhq封装，180830，Def更改函数名
******************************************************************************/
extern int lierdaLog(const char *pcFormat, ...);

/******************************************************************************
* @函数名	调用AT指令
* @参数	at_cmd_buf_param : 需要模组执行的完整AT指令，不用加\r\n
* @参数	timeout : 超时时间
* @返回值  以字符串形式返回AT指令的执行结果
* @重要修改记录 180830，qhq 创建函数
******************************************************************************/


extern char * lierdaATCall(char *at_cmd_buf_param, uint16 timeout);

/******************************************************************************
 * @函数名:lierdaDNSResolve，用于解析动态域名
 * @参数:uHostname：需要解析的域名，例如"www.baidu.com"
 * 		uIPaddr:解析的结果，以IP形式输出，例如"111.13.100.91"
 * @返回值:无
 * @重要修改记录:181212，Def创建函数
******************************************************************************/
extern void lierdaDNSResolve(char *uHostname,char *uIPaddr);

#endif /* S_LIERDA_APP_MAIN_H_ */
