/******************************************************************************
 *  lierdaGPIO.h
 *
 *  Created on:2018年8月29日
 *  Author:Def_Lin
 ******************************************************************************/

#ifndef SRC_LIB_LIERDAGPIO_PUBLIC_LIERDAGPIO_H_
#define SRC_LIB_LIERDAGPIO_PUBLIC_LIERDAGPIO_H_

#include "neulfw.h"
#include "platform.h"
#include "gpio_definitions.h"
#include "gpio.h"

/******************************************************************************
 * @函数名:lierdaGPIOInit，用于初始化GPIO
 * @参数:无
 * @返回值:无
 * @重要修改记录:180830，Def创建函数
******************************************************************************/
void lierdaGPIOInit(void);

/******************************************************************************
 * @函数名:lierdaGPIODeinit，用于取消初始化GPIO
 * @参数:无
 * @返回值:无
 * @重要修改记录:180830，Def创建函数
******************************************************************************/
void lierdaGPIODeinit(void);

/******************************************************************************
 * @函数名:lierdaGPIOClaim，用于声明所要用的GPIO
 * @参数:pin IO口引脚，dir 输入输出模式
 * @返回值:成功返回true，失败返回false
 * @重要修改记录:180830，Def创建函数
******************************************************************************/
bool lierdaGPIOClaim(PIN pin,GPIO_DIRECTION dir);

/******************************************************************************
 * @函数名:lierdaGPIOSet，拉高IO电平
 * @参数:pin IO口引脚
 * @返回值:无
 * @重要修改记录:180830，Def创建函数
******************************************************************************/
void lierdaGPIOSet(PIN pin);

/******************************************************************************
 * @函数名:lierdaGPIOClear，拉低IO电平
 * @参数:pin IO口引脚
 * @返回值:无
 * @重要修改记录:180830，Def创建函数
******************************************************************************/
void lierdaGPIOClear(PIN pin);

/******************************************************************************
 * @函数名:lierdaGPIORelease，释放IO口
 * @参数:pin IO口引脚
 * @返回值:无
 * @重要修改记录:180830，Def创建函数
******************************************************************************/
void lierdaGPIORelease(PIN pin);

/******************************************************************************
 * @函数名:lierdaGPIOToggle，翻转IO口
 * @参数:pin IO口引脚
 * @返回值:无
 * @重要修改记录:180830，Def创建函数
******************************************************************************/
void lierdaGPIOToggle(PIN pin);

/******************************************************************************
 * @函数名:lierdaGPIORead，读取IO口的状态
 * @参数:pin IO口引脚
 * @返回值:高电平返回1，低电平返回0
 * @重要修改记录:180830，Def创建函数
******************************************************************************/
bool lierdaGPIORead(PIN pin);

/******************************************************************************
 * @函数名:lierdaGPIORegisterCallback，IO中断回调函数
 * @参数:pin IO口引脚，trigger 触发类型，callback 用户回调函数
 * @返回值:无
 * @重要修改记录:180830，Def创建函数
******************************************************************************/
void lierdaGPIORegisterCallback(PIN pin, GPIO_INTERRUPT trigger, GPIO_CALLBACK callback);

#endif /* SRC_LIB_LIERDAGPIO_PUBLIC_LIERDAGPIO_H_ */
